//Task name label
HSDTaskName = "Fax Logs";

HSDFaxLogsDescription = "Use the checkboxes to select the Fax numbers you wish to block or unblock and click Apply.";

//Table view table titles
HSDTableColumnTitleType = "Type";
HSDTableColumnTitleDate = "Date";
HSDTableColumnTitleTime = "Time";
HSDTableColumnTitleDuration = "Duration";
HSDTableColumnTitlePages = "Pages";
HSDTableColumnTitleResult = "Result";
HSDTableColumnTitleFaxNumber = "Fax Number";
HSDTableColumnTitleBlock = "Block";

//Button titles
HSDPrintButtonTitle = "Print Fax Activity Log";
HSDApplyButtonTitle = "Apply Now";

//Printing progress title
PrintingProgressTitle = "Printing… Please wait";

//Table view menu items
ReceivedFaxesLogMenuItemTitle = "Received Faxes Log";
SentFaxesLogMenuItemTitle = "Sent Faxes Log";
AllFaxesLogMenuItemTitle = "All Fax Logs";

//Max limit for fax blocking list reached error
FaxBlackListLimitErrorTitle = "Blocked Numbers Limit Reached";
FaxBlackListLimitErrorDescription = "Your device can store a maximum of %d blocked Fax numbers. Unblock some Fax numbers and then try again.";

// explanation why the fax setting were not applied
FaxNotAppliedExplanation = "Check if the device is online and connected, and is not processing a fax job.";

//Fax session types
SentSessitonType = "Sent";
RecievedSessionType = "Received";

//Fax log results
SuccessResultCode = "Success";
ErrorResultCode = "Error";
BusyResultCode = "Busy";
NoAnswerResultCode = "No Answer";
NoDialToneResultCode = "No Dial Tone";
NoDocumentResultCode = "No Document";
DocumentJamResultCode = "Document Jam";
DoorOpenResultCode = "Door Open";
PowerFailureResultCode = "Power Failure";
BlacklistedResultCode = "Blacklisted";
StorageFullResultCode = "Storage Full";
OutOfMemoryResultCode = "Out of Memory";
PhoneLineUnavailableResultCode = "Phone Line Unavailable";
FaxDisconnectedResultCode = "Fax Disconnected";
PCDisconnectedResultCode = "Computer Disconnected";
RemoteNotColorResultCode = "Remote Not Color";
CommunicationErrorResultCode = "Communication Error";
CancelledResultCode = "Cancelled";
